artillery-nodebug.log
Phase started: unnamed (index: 0, duration: 1s) 00:50:27(-0300)

Phase completed: unnamed (index: 0, duration: 1s) 00:50:28(-0300)

--------------------------------------
Metrics for period to: 00:50:30(-0300) (width: 0.99s)
--------------------------------------

http.codes.200: ................................................................ 1000
http.request_rate: ............................................................. 1000/sec
http.requests: ................................................................. 1000
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 11
  median: ...................................................................... 0
  p95: ......................................................................... 1
  p99: ......................................................................... 1
http.responses: ................................................................ 1000
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 8.2
  max: ......................................................................... 43.8
  median: ...................................................................... 10.7
  p95: ......................................................................... 14.2
  p99: ......................................................................... 21.5


All VUs finished. Total time: 3 seconds

--------------------------------
Summary report @ 00:50:31(-0300)
--------------------------------

http.codes.200: ................................................................ 1000
http.request_rate: ............................................................. 1000/sec
http.requests: ................................................................. 1000
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 11
  median: ...................................................................... 0
  p95: ......................................................................... 1
  p99: ......................................................................... 1
http.responses: ................................................................ 1000
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 8.2
  max: ......................................................................... 43.8
  median: ...................................................................... 10.7
  p95: ......................................................................... 14.2
  p99: ......................................................................... 21.5